server/app/controllers/conversations_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ? AND (delivered_at < '2015-05-21 23:23:32.413574')  [["conversation_id", 3]]
---
  def show
    @conversation = Conversation.find(params['id']) if params['id'].present?
    @conversation ||= Conversation.own_for(sender, recipient).first

    if @conversation.blank? || ![@conversation.sender, @conversation.recipient].include?(current_user)
      render json: {}, status: :unprocessable_entity
    end

    @messages = @conversation.messages
    @messages = @messages.where('delivered_at < ?', Time.now)