server/app/controllers/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "conversations".* FROM "conversations" INNER JOIN "users_to_conversations" ON "conversations"."id" = "users_to_conversations"."conversation_id" WHERE "users_to_conversations"."sender_id" = ? AND "conversations"."id" = ? LIMIT 1  [["sender_id", 3], ["id", 1]]
---
  def show
    @conversation = current_user.conversations.find(params['id']) if params['id'].present?
    @conversation ||= Conversations.own_for(sender, recipient).first

INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 2], ["created_at", "2015-05-22 00:25:18.141249"], ["updated_at", "2015-05-22 00:25:18.141249"]]
INSERT INTO "users_to_conversations" ("sender_id", "recipient_id", "created_at", "updated_at", "conversation_id") VALUES (?, ?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 1], ["created_at", "2015-05-21 23:20:41.127144"], ["updated_at", "2015-05-21 23:20:41.127144"], ["conversation_id", 5]]
---
  def create
    if sender.id != current_user.id
      return render json: {}, status: :unprocessable_entity
    end

    users_to_conversation = UsersToConversation.new(sender: sender, recipient: recipient)

    if users_to_conversation.save