server/app/controllers/messages_controller.rb

INSERT INTO "conversations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-21 21:50:18.384507"], ["updated_at", "2015-05-21 21:50:18.384507"]]
INSERT INTO "messages" ("title", "body", "conversation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ololo"], ["body", "oololololoo"], ["conversation_id", 3], ["created_at", "2015-05-21 21:50:18.439115"], ["updated_at", "2015-05-21 21:50:18.439115"]]
---
  def create
    if sender.id != current_user.id
      return render json: {}, status: :unprocessable_entity
    end

    @message = conversation.messages.new(message_params)

    if @message.save