server/app/controllers/sessions_controller.rb

INSERT INTO "users" ("phone", "created_at", "updated_at", "remember_token") VALUES (?, ?, ?, ?)  [["phone", "+79165730095"], ["created_at", "2015-04-17 08:54:20.323528"], ["updated_at", "2015-04-17 08:54:20.323528"], ["remember_token", "1ebdfc85e0bfeb59c95b4c73dfdf437a07f001ce"]]
SELECT  "users".* FROM "users" WHERE "users"."phone" = ? LIMIT 1  [["phone", "+79165730095"]]
---
  def create
    user = User.find_or_create_by(phone: PhonyRails.normalize_number(params['phone']))