server/app/controllers/users_controller.rb

  def update
    if params['new_phones'].present?
      new_phones = JSON.parse(params['new_phones'])
      new_phones.each do |phone|
        current_user.contact_relations.create(contact: User.find_by_phone(phone))
      end
    end

    current_user.update_attributes(user_params)
---
INSERT INTO "contact_relations" ("contact_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["contact_id", 5], ["user_id", 5], ["created_at", "2015-04-23 23:22:16.828858"], ["updated_at", "2015-04-23 23:22:16.828858"]]
SELECT  "users".* FROM "users" WHERE "users"."phone" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["phone", "+79155730095"]]
UPDATE "users" SET "name" = ?, "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Igor"], ["avatar", "http://4.bp.blogspot.com/-JOqxgp-ZWe0/U3BtyEQlEiI/AAAAAAAAOfg/Doq6Q2MwIKA/s1600/google-logo-874x288.png"], ["updated_at", "2015-05-22 02:15:47.684135"], ["id", 4]]