server/app/views/conversations/index.json.jbuilder

  json.last_message do
    last_message = conversation.messages.order(created_at: :desc).first
---
SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  ORDER BY "messages"."created_at" DESC LIMIT 1  [["conversation_id", 3]]